.archived/templates/template.org
#+TITLE: template
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="template.css"/>

* org-mode简明教程笔记
  本笔记为org-mode简明教程的笔记
  原文地址为: [[https://orgmode.org/guide/][org-mode Compact guide]]
** 基础介绍
*** org能做的事
**** 记笔记
**** 维护TODO列表
**** 做任务计划
**** 创作及发布
**** 文学编程
*** 安装好org后的可选基础配置 :ATTACH:
:PROPERTIES:
:ID:       4e679e0f-ed95-46d8-a4e0-e3a2e52f523a
:END:
    #+begin_src emacs-lisp
      (global-set-key (kbd "C-c l") 'org-store-link)
      (global-set-key (kbd "C-c a") 'org-agenda)
      (global-set-key (kbd "C-c c") 'org-capture)
    #+end_src
    在打开后缀为.org文件后会自动进入org-mode
** 文档结构
   Org是基于大纲的一种工具，大纲模式的好处是可以很好的记录笔记和临时的想法，还可以通过折叠来隐藏不需要查看的内容。
   #+begin_src emacs-lisp
     ;; 可以通过此命令或快捷键TAB进行显示和隐藏内容
     (org-cycle)
   #+end_src
*** 标题
    Org用*号表示标题的层级关系，就像这样:
    #+begin_src org
      ,* 标题一
        一些文字
      ,** 子标题1
         子标题1的内容
      ,** 子标题2
         子标题2的内容
      ,* 标题二
        标题二的内容
      ,** 子标题1
         子标题1的内容
    #+end_src
**** 其他
***** 标题的标题是啥？
      标题的标题叫脚注，后面会讲，其中一个功能就是会在被导出时忽略掉
***** 不想看那么多星星咋办？
      后面也会讲到，不过这里可以提前说一下:
      #+begin_src org
        ,#+STARTUP: hidestars odd
        ,* 标题一
          一些文字
        ,** 子标题1
           子标题1的内容
        ,** 子标题2
           子标题2的内容
        ,* 标题二
          标题二的内容
        ,** 子标题1
           子标题1的内容

      #+end_src
*** 不同的显示样式
    Org-mode有三种大纲显示模式，而又分为两种不同的状态:
**** 子项 Subtree
     - FOLDED 折叠
     - CHILDREN 不知道咋翻译
     - SUBTREE 不知道咋翻译
       将光标放置与某个子项上键入_TAB_即可切换三种不同的显示模式，如果键入了_C-u TAB_或者是_S-TAB_（这里的S-，是Shift）将会调用全局的显示状态。
**** 全局 Global
     - OVERVIEW 概览
     - CONTENTS 目次
     - SHOW ALL 全部显示
       可以在键入_S-TAB_或_C-u TAB_在这三个显示模式下切换，如果键入_C-u C-u C-u TAB_就会直接切换为SHOW ALL显示模式
**** 其他
     Org打开一个文件时默认为*概览*模式，想要设置打开一个文件后的显示模式可以设置变量~org-startuop-folded~：
     #+begin_src emacs-lisp
       ;; 非空意味着概览OVERVIEW，nil意味着全部显示SHOW ALL
       (setq org-startup-folded t)
     #+end_src
     如果要针对单独的org文件配置，可以在org文件开头设置:
     #+begin_src org
       ,#+STARTUP: overview
     #+end_src
     可选参数有:
     - content
     - overview
     - showall
*** 移动相关
    以下是关于在标题间跳转的命令
    _C-c C-n_	下一个标题
    _C-c C-p_	上一个标题
    _C-c C-f_	下一个同级标题
    _C-c C-b_	上一个同级标题
    _C-c C-u_	跳转到父级目录
*** 结构编辑
    _M-RET_	创建同级别的新标题（如果在一个列表项中，则会创建新的列表项/如果在某一行中间键入，将会将其分割并创建新的标题）。
    _M-S-RET_	创建同级别的TODO条目
    _TAB_	循环改变未指定标题名的标题的标题等级
    _M_LEFT/RIGHT_	将当前标题提升或降级
    _M_UP/DOWN_	上下交换同级别
    _C-c C-w_	将当前条目放置与指定条目下
    _C-x n s/w_	以当前子项为单位进行变窄和变宽
**** 其他
     如果在创建统计目录的新标题时不想分割标题可以定制变量~org-M-RET-may-split-line~，例子（具体请查看文档）:
     #+begin_src emacs-lisp
       ;; 默认不分割
       (setq org-M-RET-may-split-line '((headline . nil)))
     #+end_src
*** Sparse Trees 不知道咋翻译，称为稀疏树
    org有关很重要的功能，根据选定的信息构建Sparse Trees
    _
    C-c /_	这会提示你要使用哪些Sparse Trees的命令
    _C-c / r_	使用正则匹配，所有可匹配的Sparse Trees，匹配到的会高亮，键入_C-c C-c_取消高亮。
*** 清单列表
    我们不仅可以创建标题样的条目，还能创建例如：复选框，有序无序列表。
    * 有序无须列表的创建方式：
      - 无序列表用“-”，“+”或“*”
      - 有序列表用“1. sometext”或“1) sometext”
      - 可以指定列表的说明，用“::”与条目标题与说明隔开

    同一个列表的项目的第一行必须是相同的缩进，下面是一些例子:
    * 西游记观后感
      我最喜欢的场景有（顺序）
      1. 三打白骨精
      2. 女儿国
         + 要我是唐僧可能就留下来了
         + 可惜我不是，哈哈哈
      我最喜欢的角色有
      - 如来佛祖 :: 跟我爸的体型有得一拼
      - 孙悟空 :: 好一个齐天大圣！


    * 下面是一些按键的介绍:-
      - _TAB_ :: 类似于标题的折叠
      - _M-RET_ :: 新建同级项，如果要改变条目类型，可以使用前缀参数
      - _M-S_RET_ :: 新建带有复选框的同级项
      - _M-S-UP/DOWN_ :: 上下移动当前项，如果是有序的还会自动编号。
      - _M-LEFT/RIGHT_ :: 将当前项降级或者升级
      - _C-c C-c_ :: 勾选复选框
      - _C-c -_ :: 循环修改当前项的条目符号('-','+','*','1.','1\)')。
