.archived/templates/template.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-27 四 00:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>template</title>
<meta name="author" content="oeyoews" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="template.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">template</h1>

<div id="outline-container-org4698157" class="outline-2">
<h2 id="org4698157"><span class="section-number-2">1.</span> org-mode简明教程笔记</h2>
<div class="outline-text-2" id="text-1">
<p>
本笔记为org-mode简明教程的笔记
原文地址为: <a href="https://orgmode.org/guide/">org-mode Compact guide</a>
</p>
</div>
<div id="outline-container-org421c382" class="outline-3">
<h3 id="org421c382"><span class="section-number-3">1.1.</span> 基础介绍</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org9f87573" class="outline-4">
<h4 id="org9f87573"><span class="section-number-4">1.1.1.</span> org能做的事</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<div id="outline-container-org8a843b4" class="outline-5">
<h5 id="org8a843b4">记笔记</h5>
</div>
<div id="outline-container-org8261cdd" class="outline-5">
<h5 id="org8261cdd">维护TODO列表</h5>
</div>
<div id="outline-container-org432ab02" class="outline-5">
<h5 id="org432ab02">做任务计划</h5>
</div>
<div id="outline-container-orgd8b4f34" class="outline-5">
<h5 id="orgd8b4f34">创作及发布</h5>
</div>
<div id="outline-container-orgc3743bb" class="outline-5">
<h5 id="orgc3743bb">文学编程</h5>
</div>
</div>
<div id="outline-container-orgc6387db" class="outline-4">
<h4 id="orgc6387db"><span class="section-number-4">1.1.2.</span> 安装好org后的可选基础配置&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ATTACH">ATTACH</span></span></h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">      <span style="color: #51afef;">(</span><span style="color: #c678dd;">global-set-key</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">kbd</span> <span style="color: #98be65;">"C-c l"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-store-link</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #c678dd;">global-set-key</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">kbd</span> <span style="color: #98be65;">"C-c a"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-agenda</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #c678dd;">global-set-key</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">kbd</span> <span style="color: #98be65;">"C-c c"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-capture</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
在打开后缀为.org文件后会自动进入org-mode
</p>
</div>
</div>
</div>
<div id="outline-container-orgd4782dd" class="outline-3">
<h3 id="orgd4782dd"><span class="section-number-3">1.2.</span> 文档结构</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Org是基于大纲的一种工具，大纲模式的好处是可以很好的记录笔记和临时的想法，还可以通过折叠来隐藏不需要查看的内容。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">     <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#21487;&#20197;&#36890;&#36807;&#27492;&#21629;&#20196;&#25110;&#24555;&#25463;&#38190;TAB&#36827;&#34892;&#26174;&#31034;&#21644;&#38544;&#34255;&#20869;&#23481;</span>
     <span style="color: #51afef;">(</span><span style="color: #c678dd;">org-cycle</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org4a629d9" class="outline-4">
<h4 id="org4a629d9"><span class="section-number-4">1.2.1.</span> 标题</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Org用*号表示标题的层级关系，就像这样:
</p>
<div class="org-src-container">
<pre class="src src-org">      <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#26631;&#39064;&#19968;
        &#19968;&#20123;&#25991;&#23383;
      ** <span style="text-decoration: underline;">&#23376;&#26631;&#39064;1</span>
<span style="text-decoration: underline;">         &#23376;&#26631;&#39064;1</span>&#30340;&#20869;&#23481;
      ** <span style="text-decoration: underline;">&#23376;&#26631;&#39064;2</span>
<span style="text-decoration: underline;">         &#23376;&#26631;&#39064;2</span>&#30340;&#20869;&#23481;
      <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#26631;&#39064;&#20108;
        &#26631;&#39064;&#20108;&#30340;&#20869;&#23481;
      ** <span style="text-decoration: underline;">&#23376;&#26631;&#39064;1</span>
<span style="text-decoration: underline;">         &#23376;&#26631;&#39064;1</span>&#30340;&#20869;&#23481;
</pre>
</div>
</div>
<div id="outline-container-orgd3bf941" class="outline-5">
<h5 id="orgd3bf941">其他</h5>
<div class="outline-text-5" id="text-orgd3bf941">
</div>
<ul class="org-ul">
<li><a id="org42bc0bd"></a>标题的标题是啥？<br />
<div class="outline-text-6" id="text-org42bc0bd">
<p>
标题的标题叫脚注，后面会讲，其中一个功能就是会在被导出时忽略掉
</p>
</div>
</li>
<li><a id="org5f45cb3"></a>不想看那么多星星咋办？<br />
<div class="outline-text-6" id="text-org5f45cb3">
<p>
后面也会讲到，不过这里可以提前说一下:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">        #+STARTUP: hidestars odd</span>
        <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#26631;&#39064;&#19968;
          &#19968;&#20123;&#25991;&#23383;
        ** <span style="text-decoration: underline;">&#23376;&#26631;&#39064;1</span>
<span style="text-decoration: underline;">           &#23376;&#26631;&#39064;1</span>&#30340;&#20869;&#23481;
        ** <span style="text-decoration: underline;">&#23376;&#26631;&#39064;2</span>
<span style="text-decoration: underline;">           &#23376;&#26631;&#39064;2</span>&#30340;&#20869;&#23481;
        <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#26631;&#39064;&#20108;
          &#26631;&#39064;&#20108;&#30340;&#20869;&#23481;
        ** <span style="text-decoration: underline;">&#23376;&#26631;&#39064;1</span>
<span style="text-decoration: underline;">           &#23376;&#26631;&#39064;1</span>&#30340;&#20869;&#23481;

</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org074f050" class="outline-4">
<h4 id="org074f050"><span class="section-number-4">1.2.2.</span> 不同的显示样式</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Org-mode有三种大纲显示模式，而又分为两种不同的状态:
</p>
</div>
<div id="outline-container-orgfead827" class="outline-5">
<h5 id="orgfead827">子项 Subtree</h5>
<div class="outline-text-5" id="text-orgfead827">
<ul class="org-ul">
<li>FOLDED 折叠</li>
<li>CHILDREN 不知道咋翻译</li>
<li>SUBTREE 不知道咋翻译
将光标放置与某个子项上键入_TAB_即可切换三种不同的显示模式，如果键入了_C-u TAB_或者是_S-TAB_（这里的S-，是Shift）将会调用全局的显示状态。</li>
</ul>
</div>
</div>
<div id="outline-container-org3585f15" class="outline-5">
<h5 id="org3585f15">全局 Global</h5>
<div class="outline-text-5" id="text-org3585f15">
<ul class="org-ul">
<li>OVERVIEW 概览</li>
<li>CONTENTS 目次</li>
<li>SHOW ALL 全部显示
可以在键入_S-TAB_或_C-u TAB_在这三个显示模式下切换，如果键入_C-u C-u C-u TAB_就会直接切换为SHOW ALL显示模式</li>
</ul>
</div>
</div>
<div id="outline-container-org4316309" class="outline-5">
<h5 id="org4316309">其他</h5>
<div class="outline-text-5" id="text-org4316309">
<p>
Org打开一个文件时默认为*概览*模式，想要设置打开一个文件后的显示模式可以设置变量~org-startuop-folded~：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#38750;&#31354;&#24847;&#21619;&#30528;&#27010;&#35272;OVERVIEW&#65292;nil&#24847;&#21619;&#30528;&#20840;&#37096;&#26174;&#31034;SHOW ALL</span>
       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-startup-folded</span> t<span style="color: #51afef;">)</span>
</pre>
</div>
<p>
如果要针对单独的org文件配置，可以在org文件开头设置:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">       #+STARTUP: overview</span>
</pre>
</div>
<p>
可选参数有:
</p>
<ul class="org-ul">
<li>content</li>
<li>overview</li>
<li>showall</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8ec9348" class="outline-4">
<h4 id="org8ec9348"><span class="section-number-4">1.2.3.</span> 移动相关</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
以下是关于在标题间跳转的命令
<span class="underline">C-c C-n</span> 下一个标题
<span class="underline">C-c C-p</span> 上一个标题
<span class="underline">C-c C-f</span> 下一个同级标题
<span class="underline">C-c C-b</span> 上一个同级标题
<span class="underline">C-c C-u</span> 跳转到父级目录
</p>
</div>
</div>
<div id="outline-container-orgf47f909" class="outline-4">
<h4 id="orgf47f909"><span class="section-number-4">1.2.4.</span> 结构编辑</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
<span class="underline">M-RET</span> 创建同级别的新标题（如果在一个列表项中，则会创建新的列表项/如果在某一行中间键入，将会将其分割并创建新的标题）。
<span class="underline">M-S-RET</span> 创建同级别的TODO条目
<span class="underline">TAB</span> 循环改变未指定标题名的标题的标题等级
<span class="underline">M_LEFT/RIGHT</span> 将当前标题提升或降级
<span class="underline">M_UP/DOWN</span> 上下交换同级别
<span class="underline">C-c C-w</span> 将当前条目放置与指定条目下
<span class="underline">C-x n s/w</span> 以当前子项为单位进行变窄和变宽
</p>
</div>
<div id="outline-container-org77af124" class="outline-5">
<h5 id="org77af124">其他</h5>
<div class="outline-text-5" id="text-org77af124">
<p>
如果在创建统计目录的新标题时不想分割标题可以定制变量~org-M-RET-may-split-line~，例子（具体请查看文档）:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#40664;&#35748;&#19981;&#20998;&#21106;</span>
       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-M-RET-may-split-line</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>headline . nil<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1342b90" class="outline-4">
<h4 id="org1342b90"><span class="section-number-4">1.2.5.</span> Sparse Trees 不知道咋翻译，称为稀疏树</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
org有关很重要的功能，根据选定的信息构建Sparse Trees
_
C-c /_	这会提示你要使用哪些Sparse Trees的命令
<span class="underline">C-c / r</span> 使用正则匹配，所有可匹配的Sparse Trees，匹配到的会高亮，键入_C-c C-c_取消高亮。
</p>
</div>
</div>
<div id="outline-container-org241ad45" class="outline-4">
<h4 id="org241ad45"><span class="section-number-4">1.2.6.</span> 清单列表</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
我们不仅可以创建标题样的条目，还能创建例如：复选框，有序无序列表。
</p>
<ul class="org-ul">
<li>有序无须列表的创建方式：
<ul class="org-ul">
<li>无序列表用“-”，“+”或“*”</li>
<li>有序列表用“1. sometext”或“1) sometext”</li>
<li>可以指定列表的说明，用“::”与条目标题与说明隔开</li>
</ul></li>
</ul>

<p>
同一个列表的项目的第一行必须是相同的缩进，下面是一些例子:
</p>
<ul class="org-ul">
<li><p>
西游记观后感
我最喜欢的场景有（顺序）
</p>
<ol class="org-ol">
<li>三打白骨精</li>
<li>女儿国
<ul class="org-ul">
<li>要我是唐僧可能就留下来了</li>
<li>可惜我不是，哈哈哈</li>
</ul></li>
</ol>
<p>
我最喜欢的角色有
</p>
<dl class="org-dl">
<dt>如来佛祖</dt><dd>跟我爸的体型有得一拼</dd>
<dt>孙悟空</dt><dd>好一个齐天大圣！</dd>
</dl></li>
</ul>


<ul class="org-ul">
<li>下面是一些按键的介绍:-
<dl class="org-dl">
<dt><span class="underline">TAB</span></dt><dd>类似于标题的折叠</dd>
<dt><span class="underline">M-RET</span></dt><dd>新建同级项，如果要改变条目类型，可以使用前缀参数</dd>
<dt><span class="underline">M-S_RET</span></dt><dd>新建带有复选框的同级项</dd>
<dt><span class="underline">M-S-UP/DOWN</span></dt><dd>上下移动当前项，如果是有序的还会自动编号。</dd>
<dt><span class="underline">M-LEFT/RIGHT</span></dt><dd>将当前项降级或者升级</dd>
<dt><span class="underline">C-c C-c</span></dt><dd>勾选复选框</dd>
<dt><span class="underline">C-c -</span></dt><dd>循环修改当前项的条目符号(&rsquo;-&rsquo;,&rsquo;+&rsquo;,&rsquo;*&rsquo;,&rsquo;1.&rsquo;,&rsquo;1\)&rsquo;)。</dd>
</dl></li>
</ul>
</div>
</div>
</div>
