.archived/templates/template.org
** 表格
   Org带有一个快速直观的表格编辑器，如果与Emacs的*calc*包一起使用可以实现类似电子表格的计算。

   * 想要创建一个表格分为以下几步
     1. 先创建列名
        #+begin_src org
          | name     | age | tel |




        #+end_src
     2. 创建分割线
        #+begin_src org
          | name | tel | age |
          |------+-----+-----|

          | name | tel | age|
          | -
            |
            - - > TAB
        #+end_src
     3. 按TAB或RET新建行
*** 按键说明
    - _C-c C-c_ :: 重新对齐表格
    - _TAB_ :: 重新对齐表格/移动到下一个单元格/创建新行
    - _S-TAB_ :: 重新对齐表格/移动到上一个单元格
    - _RET_ :: 重新对齐表格，并移动到下一行/创建新行
    - _S-UP/DOWN/LEFT/RIGHT_ :: 交换单元格为上下左右的单元格
    - _M-LEFT/RIGHT :: 交换列为左边或右边的列
    - _M-S-LEFT_ :: 删除当前列
    - _M-S-RIGHT_ :: 向右插入新列
    - _M-UP/DOWN_ :: 上下移动当前行
    - _M-S-UP_ :: 删除当前行
    - _M-S-DOWN_ :: 在当前行上方插入新行，如果指定前缀参数会下下方插入新行
    - _C-c -_ :: 在当前行上插入分割线
    - _C-c RET_ :: 在当前行下插入分割线，并移动到水平线下一行
    - _C-c ^_ :: 根据当前列对表格进行排序
       c

** 超链接
   * 超链接有两种定义方式
     - 带说明的超链接
       #+begin_src org
         [[https://www.baidu.com][百度一下，你就知道]]
       #+end_src
     - 不带说明的超链接
       #+begin_src org
         [[www.baidu.com]]
       #+end_src
   * 超链接的链接方式
     - 内部链接
       也就是指链接与当前文件的一些链接，例如链接到当前文件某处
       #+begin_src org
         [[My Target1]]
         [[My Target2][目标2]]



         <<My Target1>>
         <<My Target2>>
       #+end_src
     - 外部链接
       org的超链接支持指向文件，网站，电子邮件等等
       #+begin_src org
         [[https://www.baidu.com][百度一下，你就知道]]
         [[file:~/.emacs.d/init.el][Emacs Config - init.el]]
         [[mailto:the_lty_mail@foxmail.com][EvanMeek's 邮箱]]
         [[irc:/irc.com/#emacs/evanmeek][IRC Emacs]]
         [[info:org#Hyperlinks][Emacs Org超链接内部文档]]
       #+end_src
       + 其他
         在指定文件为指向的链接时，可以指定特定行或目标:
         - 特定行
           #+begin_src org
             [[file:~/.emacs.d/init.el::15][Emacs Config - init.el 15L]]
           #+end_src
         - 特定目标
           #+begin_src org
             [[file:~/.emacs.d/test.org::Test Target][test.org Test Target]]
           #+end_src
   * 处理超链接
     我们可以使用命令~org-store-link~存储当前的位置，然后再通过一些处理超链接的方式处理当前位置的链接，你可以将其绑定一个快捷键，[[*安装好org后的可选基础配置][见: 安装好org后的可选基础配置]]


   _C-c C-l_	插入链接
   _C-c C-l_	当光标置于一个超链接上，可以直接编辑它
   _C-c C-o_	打开当前光标下的超链接
** 待办事项
*** 待办事项基础
**** LOOP 基础的待办事项功能
     当标题的开头为"T[[https:oeyoew.top][hello]]ODO"时，任何标题都会成为一个待办事项，例如:
     #+begin_src org
       ,* TODO 完成ORG-MODE笔记xxx部分
     #+end_src
     可以通过按键_C-c C-t_来对一个已存在标题标记不同的待办状态，默认情况下有三种待办状态:
     - TODO :: 待办事项
     - DONE :: 已完成的待办事项
     - unmarked :: 未标记为待办事项的标题，也就是普通的标题
     -  ::


     还可以通过agenda缓冲区的~t~命令按键来远程完成切换不同待办状态。

     下面是一些按键说明:

     - _S-RIGHT/LEFT_ :: 选择前或后一种待办状态，类似于循环切换待办状态.
     - _C-c / t_ :: 用[[*Sparse Trees 不知道咋翻译，称为稀疏树][Sparse Trees]]浏览待办事项。这将会折叠整个buffer，但是会显示所有的待办状态（除了DONE状态），以及标题的层级关系。
     - ~M-x org-agenda t~ :: 显示全局的待办事项，待办事项列表从所有的agenda文件中收集，然后在一个单独的缓冲区内显示。
     - _S-M-RET_ :: 新建一个待办事项
***** 其他
      也可以通过改变标签从而修改待办事项状态，具体见函数[[help:org-todo-trigger-tag-changes][org-todo-tigger-tag-changes]]的文档。
**** OKAY 多种工作流状态
     你可以为使用"TODO"关键字表明@emph[顺序]工作流状态:
     #+begin_src emacs-lisp
       (setq org-todo-keywords
             '((sequence "TODO" "FEEDBACK" "VERIFY" "|" "DONE" "DELEGATED")))
     #+end_src
     竖线之前的状态代表需要完成的事，而之后代表已完成的事。如果你没有提供竖线作为分割，那么就会把最后一个状态作为"DONE"的状态。安装好后，你就可以使用_C-c C-t_来循环切换这几个状态了。
     有时你可能想要使用不同的方式设置"TODO"关键字，例如，你可能想要最基本的”TODO=/=DONE"，但同时也想要有修复bug的工作流，
     你可以安装以下的代码:
     #+begin_src emacs-lisp
       (setq org-todo-keywords
             '((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d)" "CANCEL(c)")
               (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")))
     #+end_src
     以上代码让你在为一个标题提供待办事项状态时添加了一个键序列，你可以键入_C-c C-t_来查看效果。

     如果你想为单独的Org文件提供一个待办状态，并且为其添加键序列，可以使用如下配置:
     #+begin_src org
       ,#+TODO: TODO(t) | DONE(d)
       ,#+TODO: REPORT(r) BUG(b) KNOWNCAUSE(k) | FIXED(f)
       ,#+TODO: | CANCELED(c)
     #+end_src
