.archived/templates/template.html
<div id="outline-container-orgbf5afb6" class="outline-3">
<h3 id="orgbf5afb6"><span class="section-number-3">1.3.</span> 表格</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Org带有一个快速直观的表格编辑器，如果与Emacs的*calc*包一起使用可以实现类似电子表格的计算。
</p>

<ul class="org-ul">
<li>想要创建一个表格分为以下几步
<ol class="org-ol">
<li><p>
先创建列名
</p>
<div class="org-src-container">
<pre class="src src-org">          <span style="color: #a9a1e1;">| name     | age | tel |</span>




</pre>
</div></li>
<li><p>
创建分割线
</p>
<div class="org-src-container">
<pre class="src src-org">          <span style="color: #a9a1e1;">| name | tel | age |</span>
          <span style="color: #a9a1e1;">|------+-----+-----|</span>

          <span style="color: #a9a1e1;">| name | tel | age|</span>
          <span style="color: #a9a1e1;">| -</span>
            |
            <span style="color: #51afef;">-</span> - &gt; TAB
</pre>
</div></li>
<li>按TAB或RET新建行</li>
</ol></li>
</ul>
</div>
<div id="outline-container-org51893b1" class="outline-4">
<h4 id="org51893b1"><span class="section-number-4">1.3.1.</span> 按键说明</h4>
<div class="outline-text-4" id="text-1-3-1">
<dl class="org-dl">
<dt><span class="underline">C-c C-c</span></dt><dd>重新对齐表格</dd>
<dt><span class="underline">TAB</span></dt><dd>重新对齐表格/移动到下一个单元格/创建新行</dd>
<dt><span class="underline">S-TAB</span></dt><dd>重新对齐表格/移动到上一个单元格</dd>
<dt><span class="underline">RET</span></dt><dd>重新对齐表格，并移动到下一行/创建新行</dd>
<dt><span class="underline">S-UP/DOWN/LEFT/RIGHT</span></dt><dd>交换单元格为上下左右的单元格</dd>
<dt>_M-LEFT/RIGHT</dt><dd>交换列为左边或右边的列</dd>
<dt><span class="underline">M-S-LEFT</span></dt><dd>删除当前列</dd>
<dt><span class="underline">M-S-RIGHT</span></dt><dd>向右插入新列</dd>
<dt><span class="underline">M-UP/DOWN</span></dt><dd>上下移动当前行</dd>
<dt><span class="underline">M-S-UP</span></dt><dd>删除当前行</dd>
<dt><span class="underline">M-S-DOWN</span></dt><dd>在当前行上方插入新行，如果指定前缀参数会下下方插入新行</dd>
<dt><span class="underline">C-c -</span></dt><dd>在当前行上插入分割线</dd>
<dt><span class="underline">C-c RET</span></dt><dd>在当前行下插入分割线，并移动到水平线下一行</dd>
<dt><span class="underline">C-c ^</span></dt><dd>根据当前列对表格进行排序
c</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org0514e18" class="outline-3">
<h3 id="org0514e18"><span class="section-number-3">1.4.</span> 超链接</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>超链接有两种定义方式
<ul class="org-ul">
<li><p>
带说明的超链接
</p>
<div class="org-src-container">
<pre class="src src-org">         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="https://www.baidu.com">&#30334;&#24230;&#19968;&#19979;&#65292;&#20320;&#23601;&#30693;&#36947;</a></span>
</pre>
</div></li>
<li><p>
不带说明的超链接
</p>
<div class="org-src-container">
<pre class="src src-org">         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="www.baidu.com">www.baidu.com</a></span>
</pre>
</div></li>
</ul></li>
<li>超链接的链接方式
<ul class="org-ul">
<li><p>
内部链接
也就是指链接与当前文件的一些链接，例如链接到当前文件某处
</p>
<div class="org-src-container">
<pre class="src src-org">         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="My Target1">My Target1</a></span>
         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="My Target2">&#30446;&#26631;2</a></span>



         <span style="text-decoration: underline;">&lt;&lt;My Target1&gt;&gt;</span>
         <span style="text-decoration: underline;">&lt;&lt;My Target2&gt;&gt;</span>
</pre>
</div></li>
<li><p>
外部链接
org的超链接支持指向文件，网站，电子邮件等等
</p>
<div class="org-src-container">
<pre class="src src-org">         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="https://www.baidu.com">&#30334;&#24230;&#19968;&#19979;&#65292;&#20320;&#23601;&#30693;&#36947;</a></span>
         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="file:~/.emacs.d/init.el">Emacs Config - init.el</a></span>
         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="mailto:the_lty_mail@foxmail.com">EvanMeek's &#37038;&#31665;</a></span>
         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="irc:/irc.com/#emacs/evanmeek">IRC Emacs</a></span>
         <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="info:org#Hyperlinks">Emacs Org&#36229;&#38142;&#25509;&#20869;&#37096;&#25991;&#26723;</a></span>
</pre>
</div>
<ul class="org-ul">
<li>其他
在指定文件为指向的链接时，可以指定特定行或目标:
<ul class="org-ul">
<li><p>
特定行
</p>
<div class="org-src-container">
<pre class="src src-org">             <span style="color: #51afef; font-weight: bold; text-decoration: underline;"><a href="file:~/.emacs.d/init.el::15">Emacs Config - init.el 15L</a></span>
</pre>
</div></li>
<li><p>
特定目标
</p>
<div class="org-src-container">
<pre class="src src-org">             <span style="color: #ECBE7B; font-weight: bold; text-decoration: underline;"><a href="file:~/.emacs.d/test.org::Test Target">test.org Test Target</a></span>
</pre>
</div></li>
</ul></li>
</ul></li>
</ul></li>
<li>处理超链接
我们可以使用命令~org-store-link~存储当前的位置，然后再通过一些处理超链接的方式处理当前位置的链接，你可以将其绑定一个快捷键，<a href="#orgc6387db">见: 安装好org后的可选基础配置</a></li>
</ul>


<p>
<span class="underline">C-c C-l</span> 插入链接
<span class="underline">C-c C-l</span> 当光标置于一个超链接上，可以直接编辑它
<span class="underline">C-c C-o</span> 打开当前光标下的超链接
</p>
</div>
</div>
<div id="outline-container-orga590dca" class="outline-3">
<h3 id="orga590dca"><span class="section-number-3">1.5.</span> 待办事项</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgfcaf316" class="outline-4">
<h4 id="orgfcaf316"><span class="section-number-4">1.5.1.</span> 待办事项基础</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
<div id="outline-container-orgea87bb2" class="outline-5">
<h5 id="orgea87bb2"><span class="todo LOOP">LOOP</span> 基础的待办事项功能</h5>
<div class="outline-text-5" id="text-orgea87bb2">
<p>
当标题的开头为&ldquo;T<a href="https:oeyoew.top">hello</a>ODO&rdquo;时，任何标题都会成为一个待办事项，例如:
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#23436;&#25104;ORG-MODE&#31508;&#35760;xxx&#37096;&#20998;
</pre>
</div>
<p>
可以通过按键_C-c C-t_来对一个已存在标题标记不同的待办状态，默认情况下有三种待办状态:
</p>
<dl class="org-dl">
<dt>TODO</dt><dd>待办事项</dd>
<dt>DONE</dt><dd>已完成的待办事项</dd>
<dt>unmarked</dt><dd>未标记为待办事项的标题，也就是普通的标题</dd>
<dt>(no term)</dt><dd>::</dd>
</dl>


<p>
还可以通过agenda缓冲区的~t~命令按键来远程完成切换不同待办状态。
</p>

<p>
下面是一些按键说明:
</p>

<dl class="org-dl">
<dt><span class="underline">S-RIGHT/LEFT</span></dt><dd>选择前或后一种待办状态，类似于循环切换待办状态.</dd>
<dt><span class="underline">C-c / t</span></dt><dd>用<a href="#org1342b90">Sparse Trees</a>浏览待办事项。这将会折叠整个buffer，但是会显示所有的待办状态（除了DONE状态），以及标题的层级关系。</dd>
<dt><code>M-x org-agenda t</code></dt><dd>显示全局的待办事项，待办事项列表从所有的agenda文件中收集，然后在一个单独的缓冲区内显示。</dd>
<dt><span class="underline">S-M-RET</span></dt><dd>新建一个待办事项</dd>
</dl>
</div>
<ul class="org-ul">
<li><a id="org65db1f6"></a>其他<br />
<div class="outline-text-6" id="text-org65db1f6">
<p>
也可以通过改变标签从而修改待办事项状态，具体见函数<a href="org-todo-trigger-tag-changes">org-todo-tigger-tag-changes</a>的文档。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3bc5769" class="outline-5">
<h5 id="org3bc5769"><span class="done OKAY">OKAY</span> 多种工作流状态</h5>
<div class="outline-text-5" id="text-org3bc5769">
<p>
你可以为使用&ldquo;TODO&rdquo;关键字表明@emph[顺序]工作流状态:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-todo-keywords</span>
             <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>sequence <span style="color: #98be65;">"</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;">"</span> <span style="color: #98be65;">"FEEDBACK"</span> <span style="color: #98be65;">"VERIFY"</span> <span style="color: #98be65;">"|"</span> <span style="color: #98be65;">"DONE"</span> <span style="color: #98be65;">"DELEGATED"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
竖线之前的状态代表需要完成的事，而之后代表已完成的事。如果你没有提供竖线作为分割，那么就会把最后一个状态作为&ldquo;DONE&rdquo;的状态。安装好后，你就可以使用_C-c C-t_来循环切换这几个状态了。
有时你可能想要使用不同的方式设置&ldquo;TODO&rdquo;关键字，例如，你可能想要最基本的”TODO=/=DONE&ldquo;，但同时也想要有修复bug的工作流，
你可以安装以下的代码:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-todo-keywords</span>
             <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>sequence <span style="color: #98be65;">"</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;">(t)"</span> <span style="color: #98be65;">"WAIT(w)"</span> <span style="color: #98be65;">"|"</span> <span style="color: #98be65;">"DONE(d)"</span> <span style="color: #98be65;">"CANCEL(c)"</span><span style="color: #98be65;">)</span>
               <span style="color: #98be65;">(</span>sequence <span style="color: #98be65;">"REPORT(r)"</span> <span style="color: #98be65;">"</span><span style="color: #ff6c6b; font-weight: bold;">BUG</span><span style="color: #98be65;">(b)"</span> <span style="color: #98be65;">"KNOWNCAUSE(k)"</span> <span style="color: #98be65;">"|"</span> <span style="color: #98be65;">"FIXED(f)"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
以上代码让你在为一个标题提供待办事项状态时添加了一个键序列，你可以键入_C-c C-t_来查看效果。
</p>

<p>
如果你想为单独的Org文件提供一个待办状态，并且为其添加键序列，可以使用如下配置:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">       #+TODO: TODO(t) | DONE(d)</span>
<span style="color: #83898d;">       #+TODO: REPORT(r) BUG(b) KNOWNCAUSE(k) | FIXED(f)</span>
<span style="color: #83898d;">       #+TODO: | CANCELED(c)</span>
</pre>
</div>
</div>
</div>
