.archived/templates/template.org
**** 进展日志
     记录进展日志以及改变待办状态的时间戳可以使用前缀调用命令_org-todo_。


     当你键入_C-u C-c C-t_将会提示你改变当前标题的待办状态，如果你将一个待办状态从TODO状态改为DONE状态的话，那么org就会为你创建一个时间戳，以记录你完成当前待办事项的时间。这个功能是基于一个特定的变量决定的：
     #+begin_src emacs-lisp
       (setq org-log-done 'note)
     #+end_src
     这边出了点小意外，就是我设定~org-log-done~的值，没有效果，可能是版本原因，这边简单讲下不同设定下的不同区别  。
     实现的效果大概是这样的:
     #+begin_src org
       ,* 每日任务
       ,** DONE 读书
         - State "DONE"       from "TODO"       [2020-05-05 二 19:57] \\
           读完了
         - State "TODO"       from              [2020-05-05 二 19:09] \\
           要开始读书了
           今天读《西游记》
       ,** FIXED 编程
           - State "FIXED"      from "BUG"        [2020-05-05 二 19:58] \\
             解决了BUG
           - State "BUG"        from "TODO"       [2020-05-05 二 19:57] \\
             有个BUG
           - State "TODO"       from "WAIT"       [2020-05-05 二 19:57] \\
             开始编程
           - State "WAIT"       from              [2020-05-05 二 19:55] \\
             等读完书再来写代码
       ,**  CANCEL 打游戏
             - State "CANCEL"     from "WAIT"       [2020-05-05 二 19:58] \\
               由于写代码时解决bug时间花太长了，没时间打游戏了，取消掉
             - State "WAIT"       from              [2020-05-05 二 19:56] \\
               12点之前还有时间的话就打游戏
     #+end_src
     下面我还可以对TODO关键字进行单独的设置，让其具有进展日志的功能，比如下面我们为TODO和WAIT关键字指定了默认具有记录时间戳的功能，让DONE或CANCEL关键字具有记录日志的功能：
     #+begin_src emacs-lisp
       (setq org-todo-keywords
                    '((sequence "TODO(t!)" "WAIT(w!)"  "|" "DONE(d@)" "CANCEL(c@)")))
     #+end_src
     其中*@*代表记录日志，而*!*代表记录时间戳，你也可以让他们具有两种功能: ~TODO(t@/!)~

     同样，我们也可以单独为某个org文件设置:
     #+begin_src org
       ,#+TODO: TODO(t) | WAIT(w@/!) | DONE (d!) CANCEL(c@)
     #+end_src
**** 优先级
     当你大量使用Org模式后，你可能会有大量的待办事项条目，这个时候你可以为其设置优先级标记:
     #+begin_src org
       ,*** TODO [#A] 洗碗
     #+end_src
     有三种优先级模式，A-C，若不指定优先级，'B'等级是默认的。

     - _C-c ,_ :: 设置当前标题的优先级，键入A-C设置级别，或者键入_SPC_清除标记
     - _S-UP/DOWN_ :: 提升/降低当前标题的优先级
**** TO
#+begin_export ascii
#+end_export
DO 任务细分
     我们可以将一个待办事项分为多个小的待办事项，并且可以用一些标记用于对小的待办事项做统计：
     #+begin_src org
       ,* TODO 每日任务 [33%]
       ,** TODO 写作业 [2/3]
       ,*** TODO 语文
       ,*** DONE 数学
           CLOSED: [2020-05-06 三 05:53]
           - State "DONE"       from "TODO"       [2020-05-06 三 05:53]
       ,*** DONE 英语
           CLOSED: [2020-05-06 三 07:53]
           - CLOSING NOTE [2020-05-06 三 07:53] \\
             为了 提高我的英语水平，我活出uqle
       ,** TODO 健身 [50%]
       ,*** TODO 1组仰卧起坐
       ,*** DONE 1组上下蹲
           CLOSED: [2020-05-06 三 07:52]
           - CLOSING NOTE [2020-05-06 三 07:52] \\
             累死我了
       ,*** TODO 500次跳绳
       ,*** DONE 5km慢跑
           CLOSED: [2020-05-06 三 05:55]
           - State "DONE"       from "TODO"       [2020-05-06 三 05:55]
       ,** DONE 学做菜 [2/2]
          CLOSED: [2020-05-06 三 05:56]
          - State "DONE"       from "TODO"       [2020-05-06 三 05:56]
       ,*** DONE 主菜
           CLOSED: [2020-05-06 三 05:56]
           - State "DONE"       from "TODO"       [2020-05-06 三 05:56]
           - 东坡肉
       ,*** DONE 副菜
           CLOSED: [2020-05-06 三 05:56]
           - State "DONE"       from "TODO"       [2020-05-06 三 05:56]
           - 上海青
           - 鱼汤
     #+end_src
     待办事项的进度有两种呈现方式，一种是标记为~[/]~另一种是标记为~[%]~，如果它们的子项已完成，那么当前待办事项会自动切换状态为DONE。
     _C-c C-c_ 刷新进度的状态
