.archived/templates/template.html
<div id="outline-container-org0a0d9b3" class="outline-5">
<h5 id="org0a0d9b3">进展日志</h5>
<div class="outline-text-5" id="text-org0a0d9b3">
<p>
记录进展日志以及改变待办状态的时间戳可以使用前缀调用命令_org-todo_。
</p>


<p>
当你键入_C-u C-c C-t_将会提示你改变当前标题的待办状态，如果你将一个待办状态从TODO状态改为DONE状态的话，那么org就会为你创建一个时间戳，以记录你完成当前待办事项的时间。这个功能是基于一个特定的变量决定的：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-log-done</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">note</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
这边出了点小意外，就是我设定~org-log-done~的值，没有效果，可能是版本原因，这边简单讲下不同设定下的不同区别  。
实现的效果大概是这样的:
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#27599;&#26085;&#20219;&#21153;
       ** DONE &#35835;&#20070;
         <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:57]</span> \\
           &#35835;&#23436;&#20102;
         <span style="color: #51afef;">-</span> State "TODO"       from              <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:09]</span> \\
           &#35201;&#24320;&#22987;&#35835;&#20070;&#20102;
           &#20170;&#22825;&#35835;&#12298;&#35199;&#28216;&#35760;&#12299;
       ** FIXED &#32534;&#31243;
           <span style="color: #51afef;">-</span> State "FIXED"      from "BUG"        <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:58]</span> \\
             &#35299;&#20915;&#20102;BUG
           <span style="color: #51afef;">-</span> State "BUG"        from "TODO"       <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:57]</span> \\
             &#26377;&#20010;BUG
           <span style="color: #51afef;">-</span> State "TODO"       from "WAIT"       <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:57]</span> \\
             &#24320;&#22987;&#32534;&#31243;
           <span style="color: #51afef;">-</span> State "WAIT"       from              <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:55]</span> \\
             &#31561;&#35835;&#23436;&#20070;&#20877;&#26469;&#20889;&#20195;&#30721;
       **  CANCEL &#25171;&#28216;&#25103;
             <span style="color: #51afef;">-</span> State "CANCEL"     from "WAIT"       <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:58]</span> \\
               &#30001;&#20110;&#20889;&#20195;&#30721;&#26102;&#35299;&#20915;bug&#26102;&#38388;&#33457;&#22826;&#38271;&#20102;&#65292;&#27809;&#26102;&#38388;&#25171;&#28216;&#25103;&#20102;&#65292;&#21462;&#28040;&#25481;
             <span style="color: #51afef;">-</span> State "WAIT"       from              <span style="color: #ECBE7B;">[2020-05-05 &#20108; 19:56]</span> \\
               12&#28857;&#20043;&#21069;&#36824;&#26377;&#26102;&#38388;&#30340;&#35805;&#23601;&#25171;&#28216;&#25103;
</pre>
</div>
<p>
下面我还可以对TODO关键字进行单独的设置，让其具有进展日志的功能，比如下面我们为TODO和WAIT关键字指定了默认具有记录时间戳的功能，让DONE或CANCEL关键字具有记录日志的功能：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-todo-keywords</span>
                    <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>sequence <span style="color: #98be65;">"</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;">(t!)"</span> <span style="color: #98be65;">"WAIT(w!)"</span>  <span style="color: #98be65;">"|"</span> <span style="color: #98be65;">"DONE(d@)"</span> <span style="color: #98be65;">"CANCEL(c@)"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
其中*@*代表记录日志，而*!*代表记录时间戳，你也可以让他们具有两种功能: <code>TODO(t@/!)</code>
</p>

<p>
同样，我们也可以单独为某个org文件设置:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">       #+TODO: TODO(t) | WAIT(w@/!) | DONE (d!) CANCEL(c@)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org454185a" class="outline-5">
<h5 id="org454185a">优先级</h5>
<div class="outline-text-5" id="text-org454185a">
<p>
当你大量使用Org模式后，你可能会有大量的待办事项条目，这个时候你可以为其设置优先级标记:
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="font-weight: bold;">***</span> TODO &#9873; &#27927;&#30871;
</pre>
</div>
<p>
有三种优先级模式，A-C，若不指定优先级，&rsquo;B&rsquo;等级是默认的。
</p>

<dl class="org-dl">
<dt><span class="underline">C-c ,</span></dt><dd>设置当前标题的优先级，键入A-C设置级别，或者键入_SPC_清除标记</dd>
<dt><span class="underline">S-UP/DOWN</span></dt><dd>提升/降低当前标题的优先级</dd>
</dl>
</div>
</div>
<div id="outline-container-org1684491" class="outline-5">
<h5 id="org1684491">TO</h5>
<div class="outline-text-5" id="text-org1684491">
<p>
DO 任务细分
     我们可以将一个待办事项分为多个小的待办事项，并且可以用一些标记用于对小的待办事项做统计：
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#27599;&#26085;&#20219;&#21153; <span style="color: #98be65; font-weight: bold;">[33%]</span>
       ** TODO &#20889;&#20316;&#19994; <span style="color: #98be65; font-weight: bold;">[2/3]</span>
       <span style="font-weight: bold;">***</span> TODO &#35821;&#25991;
       <span style="font-weight: bold;">***</span> DONE &#25968;&#23398;
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:53]</span>
           <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:53]</span>
       <span style="font-weight: bold;">***</span> DONE &#33521;&#35821;
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 07:53]</span>
           <span style="color: #51afef;">-</span> CLOSING NOTE <span style="color: #ECBE7B;">[2020-05-06 &#19977; 07:53]</span> \\
             &#20026;&#20102; &#25552;&#39640;&#25105;&#30340;&#33521;&#35821;&#27700;&#24179;&#65292;&#25105;&#27963;&#20986;uqle
       ** TODO &#20581;&#36523; <span style="color: #98be65; font-weight: bold;">[50%]</span>
       <span style="font-weight: bold;">***</span> TODO 1&#32452;&#20208;&#21351;&#36215;&#22352;
       <span style="font-weight: bold;">***</span> DONE 1&#32452;&#19978;&#19979;&#36466;
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 07:52]</span>
           <span style="color: #51afef;">-</span> CLOSING NOTE <span style="color: #ECBE7B;">[2020-05-06 &#19977; 07:52]</span> \\
             &#32047;&#27515;&#25105;&#20102;
       <span style="font-weight: bold;">***</span> TODO 500&#27425;&#36339;&#32499;
       <span style="font-weight: bold;">***</span> DONE 5km&#24930;&#36305;
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:55]</span>
           <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:55]</span>
       ** DONE &#23398;&#20570;&#33756; <span style="color: #5B6268; font-weight: bold;">[2/2]</span>
          <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:56]</span>
          <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:56]</span>
       <span style="font-weight: bold;">***</span> DONE &#20027;&#33756;
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:56]</span>
           <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:56]</span>
           <span style="color: #51afef;">-</span> &#19996;&#22369;&#32905;
       <span style="font-weight: bold;">***</span> DONE &#21103;&#33756;
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:56]</span>
           <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 05:56]</span>
           <span style="color: #51afef;">-</span> &#19978;&#28023;&#38738;
           <span style="color: #51afef;">-</span> &#40060;&#27748;
</pre>
</div>
<p>
待办事项的进度有两种呈现方式，一种是标记为~<code>[/]</code>~另一种是标记为~<code>[%]</code>~，如果它们的子项已完成，那么当前待办事项会自动切换状态为DONE。
<span class="underline">C-c C-c</span> 刷新进度的状态
</p>
</div>
</div>
