.archived/templates/template.org
**** 复选框 [/]
- [ ] demo

     还记得清单列表么，其中有一个复选框的样式，复选框不会被包含在全局的待办事项列表中，因此很适合用来将一个待办事项划分为多个步骤的操作：
     #+begin_src org
       ,* TODO 每日任务 [33%]
       ,** TODO 写作业 [3/3]
          - [X] 语文
          - [X] 数学
          - [X] 英语
       ,** TODO 健身 [100%]
          - [X] 1组仰卧起坐
          - [X] 1组上下蹲
          - [X] 500
          - [X] 5km慢跑
       ,** TODO 学做菜 [2/2]
       ,*** DONE 主菜 [100%]
           CLOSED: [2020-05-06 三 06:08]
           - State "DONE"       from "TODO"       [2020-05-06 三 06:08]
           - [X] 东坡肉
       ,*** DONE 副菜 [2/2]
           CLOSED: [2020-05-06 三 06:08]
           - State "DONE"       from "TODO"       [2020-05-06 三 06:08]
           - [X] 上海青
           - [X] 鱼汤
     #+end_src
** 标签
   可以为一个标题提供一个标签列表，有助将上下文进行关联。

   创建标签的方式是在任意标题后，由两个冒号包住的单词，这个单词可以是任意字母、数字、下划线、和@符号。就像这样:

   #+begin_src org
     ,* 测试标题	:@Test:title_name:etc:
   #+end_src
*** 标签继承
    Org-mode的标签可以根据大纲树继承结构，也就说子标题的标签会继承父标题的标签，不需要显式的写出来。
    #+begin_src org
      ,* TODO 公司任务                                                        :work:
      ,** DONE 小组开会                                                  :meet:talk:
      ,** TODO 编写代码                                                       :code:
    #+end_src

    上面编写代码和小组开会项就继承了公司任务的标签:work:。

    Org-mode还支持单独设置某个标签为所有标签的父标签，从而让当前文件的所有标签都继承与它。
    #+begin_src org
      ,#+FILETAGS: :EvanMeek:
    #+end_src

    当一个org文件开头写上上面这段标记后，那么这个org文件的所有标签都会继承与:EvanMeek:
*** 设置标签 :@开启:
    前面我们已经讲过一种设置标签的方式，直接在标题后手动输入，还有另外几种方式:
    - _C-c C-q_ :: 为当前标题创建新的标签
    - _C-c C-c_ :: 同上，不过只有光标在标题上才有效

    我们还可以提前创建一些常用的标签，然后通过一个单独的按键来快速创建标签，首先设置变量~org-tag-alist~:
    #+begin_src emacs-lisp
    (setq org-tag-alist '(("@work" . ?w) ("@home" . ?h) ("laptop" . ?l)))
    #+end_src

    这样设置后在我们使用_C-c C-q_或_C-c C-c_创建标签时就可以通过一些快捷键来创建标签。
    虽然这样很方便，但有随之出现一个文件，就是有些org文件根本用不上这些提前定义好的标签，所以我们就可以单独为文件提前创建标签，创建方式:

    #+begin_src org
      ,#+TAGS: @work(w) @home(h) laptop(l)
      ,#+TAGS: t_tag1 t_tag2
    #+end_src
*** 标签组
    可以将类似的标签类型定义成一组，有两种定义的方式:
    - 多选式
      #+begin_src org
        ,#+TAGS: [ 错误(e) : 已修正(f) : 已知问题(i) ]
      #+end_src
    - 单选式
      #+begin_src org
        ,#+TAGS: { 状态: @开启(o) @关闭(c) }
      #+end_src
    顾名思义多选就是可以使用标签组中任意多个标签，而单选组内只能选择一种标签
*** 搜索标签
    - _C-c / m_或_C-c \_ :: 使用稀疏树搜索
      如果指定前缀参数，那么会忽略所有非代办状态的标题
** 属性

   条目可以具有一些属性标记，这些属性被包含在一个`PROPERTIES`片段中。
   一个简单的属性例子:
   #+begin_src org
     ,* 最爱的歌手
     ,** Eminem
        :PROPERTIES:
        :COUNTRY: 美国
        :成名曲: 《The real Slim Shady》
        :唱片累计销售量: 2.2亿
        :FavoriteSong_ALL: "Lose Yourself" "MockingBird"
        :END:
     ,** 红花会贝贝
        :PROPERTIES:
        :FavoriteSong: "H.B.U.F" "Demo"
        :END:
   #+end_src

   - _C-c C-x p_ :: 设置属性
   - _C-c C-c d_ :: 删除当前属性项
** 日期和时间
   我们可以为待办事项提供时间或日期，在Org-mode中叫时间戳.
*** 时间戳
    时间戳就是一个日期（有多种格式），时间戳可以出现在org文件的任何地方（标题或正文），如果为某个条目指定了个时间戳，那么在用~org-agenda~管理待办事项时就可以筛选指定日期的待办事项操作。
**** 基本的时间戳（事件、约会）
     一个简单的时间戳只是给予了日期或时间给一个条目而已，就像你在纸上做事件或约会的计划一样。
     #+begin_src org
       ,* 约小美看电影
         <2020-05-28 四>
       ,* 开学返校
         <2020-05-18 一>
     #+end_src
**** 有规律的时间戳
     时间戳不仅可以表示具体时间的事件还可以表示每周或每月甚至每天为单位间隔的事件，这代表了每隔多久就重复做的事件:
     #+begin_src org
       ,* 去医院体检
         <2020-05-11 一 +1y>
     #+end_src
**** 日记样式的时间
     Org模式对Emacs的 *calendar/diary* 插件包提供了支持:
     #+begin_src org
       ,* 每个月的第二周召开会议
         <%%(diary-float t 4 2)>
     #+end_src
**** 时间/日期范围
     可以使用`--`来连接两个时间戳以表示时间范围
     #+begin_src org
       ,* 减肥计划
         <2021-05-01 六>--<2020-06-01 一>
     #+end_src
