.archived/templates/template.html
<div id="outline-container-org3f6fd21" class="outline-5">
<h5 id="org3f6fd21">复选框 <code>[/]</code></h5>
<div class="outline-text-5" id="text-org3f6fd21">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <p>
demo
</p>

<p>
还记得清单列表么，其中有一个复选框的样式，复选框不会被包含在全局的待办事项列表中，因此很适合用来将一个待办事项划分为多个步骤的操作：
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#27599;&#26085;&#20219;&#21153; <span style="color: #98be65; font-weight: bold;">[33%]</span>
       ** TODO &#20889;&#20316;&#19994; <span style="color: #5B6268; font-weight: bold;">[3/3]</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> &#35821;&#25991;</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> &#25968;&#23398;</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> &#33521;&#35821;</span>
       ** TODO &#20581;&#36523; <span style="color: #5B6268; font-weight: bold;">[100%]</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> 1&#32452;&#20208;&#21351;&#36215;&#22352;</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> 1&#32452;&#19978;&#19979;&#36466;</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> 500</span>
          <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> 5km&#24930;&#36305;</span>
       ** TODO &#23398;&#20570;&#33756; <span style="color: #5B6268; font-weight: bold;">[2/2]</span>
       <span style="font-weight: bold;">***</span> DONE &#20027;&#33756; <span style="color: #5B6268; font-weight: bold;">[100%]</span>
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 06:08]</span>
           <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 06:08]</span>
           <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> &#19996;&#22369;&#32905;</span>
       <span style="font-weight: bold;">***</span> DONE &#21103;&#33756; <span style="color: #5B6268; font-weight: bold;">[2/2]</span>
           <span style="color: #83898d;">CLOSED:</span> <span style="color: #ECBE7B;">[2020-05-06 &#19977; 06:08]</span>
           <span style="color: #51afef;">-</span> State "DONE"       from "TODO"       <span style="color: #ECBE7B;">[2020-05-06 &#19977; 06:08]</span>
           <span style="color: #51afef;">-</span> <span style="color: #5B6268; font-weight: bold;">[X]</span><span style="color: #5B6268;"> &#19978;&#28023;&#38738;</span>
           <span style="color: #51afef;">-</span> <span style="color: #98be65; font-weight: bold;">[X]</span> &#40060;&#27748;
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd196f6" class="outline-3">
<h3 id="orgbd196f6"><span class="section-number-3">1.6.</span> 标签</h3>
<div class="outline-text-3" id="text-1-6">
<p>
可以为一个标题提供一个标签列表，有助将上下文进行关联。
</p>

<p>
创建标签的方式是在任意标题后，由两个冒号包住的单词，这个单词可以是任意字母、数字、下划线、和@符号。就像这样:
</p>

<div class="org-src-container">
<pre class="src src-org">     <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#27979;&#35797;&#26631;&#39064; :@Test:title_name:etc:
</pre>
</div>
</div>
<div id="outline-container-org5c3f5c2" class="outline-4">
<h4 id="org5c3f5c2"><span class="section-number-4">1.6.1.</span> 标签继承</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Org-mode的标签可以根据大纲树继承结构，也就说子标题的标签会继承父标题的标签，不需要显式的写出来。
</p>
<div class="org-src-container">
<pre class="src src-org">      <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#20844;&#21496;&#20219;&#21153;                                                        :work:
      ** DONE &#23567;&#32452;&#24320;&#20250;                                                  :meet:talk:
      ** TODO &#32534;&#20889;&#20195;&#30721;                                                       :code:
</pre>
</div>

<p>
上面编写代码和小组开会项就继承了公司任务的标签:work:。
</p>

<p>
Org-mode还支持单独设置某个标签为所有标签的父标签，从而让当前文件的所有标签都继承与它。
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">      #+FILETAGS: :EvanMeek:</span>
</pre>
</div>

<p>
当一个org文件开头写上上面这段标记后，那么这个org文件的所有标签都会继承与:EvanMeek:
</p>
</div>
</div>
<div id="outline-container-orga528e31" class="outline-4">
<h4 id="orga528e31"><span class="section-number-4">1.6.2.</span> 设置标签&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">@开启</span></span></h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
前面我们已经讲过一种设置标签的方式，直接在标题后手动输入，还有另外几种方式:
</p>
<dl class="org-dl">
<dt><span class="underline">C-c C-q</span></dt><dd>为当前标题创建新的标签</dd>
<dt><span class="underline">C-c C-c</span></dt><dd>同上，不过只有光标在标题上才有效</dd>
</dl>

<p>
我们还可以提前创建一些常用的标签，然后通过一个单独的按键来快速创建标签，首先设置变量~org-tag-alist~:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">    <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-tag-alist</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"@work"</span> . ?w<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"@home"</span> . ?h<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"laptop"</span> . ?l<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
这样设置后在我们使用_C-c C-q_或_C-c C-c_创建标签时就可以通过一些快捷键来创建标签。
虽然这样很方便，但有随之出现一个文件，就是有些org文件根本用不上这些提前定义好的标签，所以我们就可以单独为文件提前创建标签，创建方式:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">      #+TAGS: </span><span style="color: #46D9FF;">@work</span><span style="color: #83898d;">(w) </span><span style="color: #46D9FF;">@home</span><span style="color: #83898d;">(h) laptop(l)</span>
<span style="color: #83898d;">      #+TAGS: t_tag1 t_tag2</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org15d908c" class="outline-4">
<h4 id="org15d908c"><span class="section-number-4">1.6.3.</span> 标签组</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
可以将类似的标签类型定义成一组，有两种定义的方式:
</p>
<ul class="org-ul">
<li><p>
多选式
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">        #+TAGS: [ &#38169;&#35823;(e) : &#24050;&#20462;&#27491;(f) : &#24050;&#30693;&#38382;&#39064;(i) ]</span>
</pre>
</div></li>
<li><p>
单选式
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #83898d;">        #+TAGS: { &#29366;&#24577;: @&#24320;&#21551;(o) @&#20851;&#38381;(c) }</span>
</pre>
</div></li>
</ul>
<p>
顾名思义多选就是可以使用标签组中任意多个标签，而单选组内只能选择一种标签
</p>
</div>
</div>
<div id="outline-container-org48434d5" class="outline-4">
<h4 id="org48434d5"><span class="section-number-4">1.6.4.</span> 搜索标签</h4>
<div class="outline-text-4" id="text-1-6-4">
<dl class="org-dl">
<dt><span class="underline">C-c / m_或_C-c \</span></dt><dd>使用稀疏树搜索
如果指定前缀参数，那么会忽略所有非代办状态的标题</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgccf6639" class="outline-3">
<h3 id="orgccf6639"><span class="section-number-3">1.7.</span> 属性</h3>
<div class="outline-text-3" id="text-1-7">
<p>
条目可以具有一些属性标记，这些属性被包含在一个`PROPERTIES`片段中。
一个简单的属性例子:
</p>
<div class="org-src-container">
<pre class="src src-org">     <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#26368;&#29233;&#30340;&#27468;&#25163;
     ** Eminem
        <span style="color: #5B6268;">:PROPERTIES:</span>
        <span style="color: #83898d;">:COUNTRY:</span> <span style="color: #83898d;">&#32654;&#22269;</span>
        <span style="color: #83898d;">:&#25104;&#21517;&#26354;:</span> <span style="color: #83898d;">&#12298;The real Slim Shady&#12299;</span>
        <span style="color: #83898d;">:&#21809;&#29255;&#32047;&#35745;&#38144;&#21806;&#37327;:</span> <span style="color: #83898d;">2.2&#20159;</span>
        <span style="color: #83898d;">:FavoriteSong_ALL:</span> <span style="color: #83898d;">"Lose Yourself" "MockingBird"</span>
        <span style="color: #5B6268;">:END:</span>
     ** &#32418;&#33457;&#20250;&#36125;&#36125;
        <span style="color: #5B6268;">:PROPERTIES:</span>
        <span style="color: #83898d;">:FavoriteSong:</span> <span style="color: #83898d;">"H.B.U.F" "Demo"</span>
        <span style="color: #5B6268;">:END:</span>
</pre>
</div>

<dl class="org-dl">
<dt><span class="underline">C-c C-x p</span></dt><dd>设置属性</dd>
<dt><span class="underline">C-c C-c d</span></dt><dd>删除当前属性项</dd>
</dl>
</div>
</div>
<div id="outline-container-orgb3f45a7" class="outline-3">
<h3 id="orgb3f45a7"><span class="section-number-3">1.8.</span> 日期和时间</h3>
<div class="outline-text-3" id="text-1-8">
<p>
我们可以为待办事项提供时间或日期，在Org-mode中叫时间戳.
</p>
</div>
<div id="outline-container-orgd6197aa" class="outline-4">
<h4 id="orgd6197aa"><span class="section-number-4">1.8.1.</span> 时间戳</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
时间戳就是一个日期（有多种格式），时间戳可以出现在org文件的任何地方（标题或正文），如果为某个条目指定了个时间戳，那么在用~org-agenda~管理待办事项时就可以筛选指定日期的待办事项操作。
</p>
</div>
<div id="outline-container-org5c24e18" class="outline-5">
<h5 id="org5c24e18">基本的时间戳（事件、约会）</h5>
<div class="outline-text-5" id="text-org5c24e18">
<p>
一个简单的时间戳只是给予了日期或时间给一个条目而已，就像你在纸上做事件或约会的计划一样。
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#32422;&#23567;&#32654;&#30475;&#30005;&#24433;
         <span style="color: #ECBE7B;">&lt;2020-05-28 &#22235;&gt;</span>
       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#24320;&#23398;&#36820;&#26657;
         <span style="color: #ECBE7B;">&lt;2020-05-18 &#19968;&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbef82af" class="outline-5">
<h5 id="orgbef82af">有规律的时间戳</h5>
<div class="outline-text-5" id="text-orgbef82af">
<p>
时间戳不仅可以表示具体时间的事件还可以表示每周或每月甚至每天为单位间隔的事件，这代表了每隔多久就重复做的事件:
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#21435;&#21307;&#38498;&#20307;&#26816;
         <span style="color: #ECBE7B;">&lt;2020-05-11 &#19968; +1y&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f957e4" class="outline-5">
<h5 id="org9f957e4">日记样式的时间</h5>
<div class="outline-text-5" id="text-org9f957e4">
<p>
Org模式对Emacs的 <b>calendar/diary</b> 插件包提供了支持:
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#27599;&#20010;&#26376;&#30340;&#31532;&#20108;&#21608;&#21484;&#24320;&#20250;&#35758;
         <span style="color: #bbc2cf;">&lt;%%(diary-float t 4 2)&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8e08c0a" class="outline-5">
<h5 id="org8e08c0a">时间/日期范围</h5>
<div class="outline-text-5" id="text-org8e08c0a">
<p>
可以使用`&#x2013;`来连接两个时间戳以表示时间范围
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#20943;&#32933;&#35745;&#21010;
         <span style="color: #ECBE7B;">&lt;2021-05-01 &#20845;&gt;--&lt;2020-06-01 &#19968;&gt;</span>
</pre>
</div>
</div>
</div>
