.archived/templates/template.org
**** 非活动时间戳
     跟普通的时间戳类似，不过括号是使用方括号，而不是尖括号，区别在于这种非活动的时间戳不会被~org-agenda~所管理。
     #+begin_src org
       ,* 第101次表白
         [2020-05-11 一]
     #+end_src
*** 创建时间戳
    想让Org-mode识别你创建的时间戳，那必须是有特殊的格式的。下面的按键或命令可以让你快速创建一些时间戳，并且符合特殊的格式。

    - _C-c ._
      提示你输入日期，确认后会在当前光标下插入时间戳。如果当前光标下已经有一个时间戳，那么就会修改那个时间戳。如果连续两次使用这个命令，将会插入一个时间范围的时间戳。当给予它前缀参数，那么将会直接插入当前的时间。
      #+begin_src org
        普通时间 C-c .
         <2020-07-10 五>
        修改时间
        <2020-05-10 日>
        时间范围
        <2021-05-01 六>--<2020-06-01 一>
      #+end_src
      [2020-09-01 二]
    - _C-c !_ :: 类似与_C-c ._，不同的是它创建的是非活动的时间戳
    - _S-LEFT/RIGHT_ ~(org-timestamp-down/up-day)~ :: 将当前光标下的时间戳提前或延迟一天
    - _S-UP/DOWN_ ~(org-timestamp-down/up)~ :: 同上，不过支持对年，月，日，周，以及时间戳类型(非活动时间戳)进行变换。
*** 截止日期和计划安排
    - State "[待办]"     from              [2020-05-12 二 13:19]
    在日常的日程安排中，需要在某些事项错过截止日期后进行警告提示，这时候可以为待办事项的时间戳添加一个关键字，从而让那个时间戳变为这个待办事项的截止日期:

    - _C-c C-d_ 插入截止时间戳
      #+begin_src org
        ,* TODO 完成ORG-MODE笔记
          DEADLINE: <2020-05-11 一>
        ,** DONE 第一部分
        ,** TODO 第二部分
      #+end_src
      如果时间超过截止日期，那么将会报一个警告，直到这个待办事项为"Done"状态才会停止警告。
    - _C-c C-s_ 插入开始时间戳
      如果有了截止日期你还需要开始日期，通过下面的按键可以插入待办事项(非必须)的开始日期:
      #+begin_src org
        ,* TODO 完成ORG-MODE笔记
          SCHEDULED: <2021-05-10 一>
          DEADLINE: <2020-05-11 一>
        ,** DONE 第一部分
        ,** TODO 第二部分
      #+end_src
      如果当前的时间超过了计划的开始时间，那么推迟一天开始时间也会自动推迟。

      有些需要重复执行的任务，可以为其添加一个间隔周期，例如下面这个例子就是每各一个月开始一次:
      #+begin_src org
        ,* TODO 完成ORG-MODE笔记
          SCHEDULED: <2021-05-10 一 +1m>
          DEADLINE: <2020-05-11 一>
        ,** DONE 第一部分
        ,** TODO 第二部分
      #+end_src
*** 记录工作时间
    org-mode可以记录你在完成某项待办事项所用时间，下面是一些按键介绍：

    - _C-c C-x C-i_ ~(org-clock-in)~ :: 开始为当前待办事项计时
      开始计时后会在当前条目下创建一个带有 *CLOCK* 关键字的时间戳,如果指定了前缀参数，那么就会从最近的计时任务中选择。
      #+begin_src org
        ,* 写代码
          :LOGBOOK:
          CLOCK: [2020-05-11 一 16:09]--[2020-05-12 二 06:36] => 14:27
          :END:
      #+end_src
    - _C-c C-x C-o_ ~(org-clock-out)~ :: 停止计时
      停止计时，它将会在刚刚开始计时处后创建一个时间戳，并且还会计算出开始时间和停止时间的时间差。
      #+begin_src org
        ,* DONE 写代码
          :LOGBOOK:
          CLOCK: [2020-05-11 一 16:10]--[2020-05-11 一 19:10] =>  3:00
          :END:
      #+end_src
      *切换待办状态为"DONE"也会停止计时*

    - _C-c C-x C-e_ ~(org-clock-modify-effort-estimate)~ :: 更新计时任务进度
    - _C-c C-x C-q_ ~(org-clock-cancel)~ :: 停止计时在你误操作计时时有用
    - _C-c C-x C-j_ ~(org-clock-go)~ :: 跳转到计时任务
      可以指定跳转到当前正在计时的条目去，如果指定前缀参数，那么会跳转到最近一次计时任务的条目下。
** 捕获-转发-归档
   组织系统必有一个很重要的功能，那就是快速的捕获新想法和新任务，并将其与某些资料关联的能力。Org-mode中使用 *Capture* 实现。它能够将与一个任务相关的文件存储在一个特殊的目录下。可能在某个系统下，任务和项目经常需要移动位置，而将整个项目树保存到一个归档文件中有利于保持系统的简洁和快速。
*** 捕获
    *本章借鉴了* [[https://www.zmonster.me/2018/02/28/org-mode-capture.html][此博客]]。
    org-mode能让你在工作时中断一会儿，来写一段简短的笔记。你可以为捕获新想法定义模板，并且将其笔记与不同的目标文件关联起来。
**** 设置捕获
     以下代码可以设置了保存笔记的默认文件地址，以及定义了一个捕获新想法的全局快捷键:
     #+begin_src emacs-lisp
       (setq org-default-notes-file  "~/Documents/org/notes.org")

       ;; 这里前面有写
       (global-set-key (kbd "C-c c") 'org-capture)
     #+end_src
*** 使用Capture
    - _M-x org-capture_ :: 开始捕获
      新建了一个缓冲区，用于编辑新捕获的想法。
    - _C-c C-c_ ::  保存并返回原窗口
      在编辑完新想法后，可以快速保存，并且返回原先的窗口，不会打断你的工作流。
    - C-c C-w ::  重新将当前项移动到其他位置
      将一个或多个条目放置与其他地方。
    - C-c C-k :: 退出捕获过程并且复原到原本的状态。
