.archived/templates/template.html
<div id="outline-container-org293961a" class="outline-5">
<h5 id="org293961a">非活动时间戳</h5>
<div class="outline-text-5" id="text-org293961a">
<p>
跟普通的时间戳类似，不过括号是使用方括号，而不是尖括号，区别在于这种非活动的时间戳不会被~org-agenda~所管理。
</p>
<div class="org-src-container">
<pre class="src src-org">       <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#31532;101&#27425;&#34920;&#30333;
         <span style="color: #ECBE7B;">[2020-05-11 &#19968;]</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org69557f3" class="outline-4">
<h4 id="org69557f3"><span class="section-number-4">1.8.2.</span> 创建时间戳</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
想让Org-mode识别你创建的时间戳，那必须是有特殊的格式的。下面的按键或命令可以让你快速创建一些时间戳，并且符合特殊的格式。
</p>

<ul class="org-ul">
<li><p>
<span class="underline">C-c .</span>
提示你输入日期，确认后会在当前光标下插入时间戳。如果当前光标下已经有一个时间戳，那么就会修改那个时间戳。如果连续两次使用这个命令，将会插入一个时间范围的时间戳。当给予它前缀参数，那么将会直接插入当前的时间。
</p>
<div class="org-src-container">
<pre class="src src-org">        &#26222;&#36890;&#26102;&#38388; C-c .
         <span style="color: #ECBE7B;">&lt;2020-07-10 &#20116;&gt;</span>
        &#20462;&#25913;&#26102;&#38388;
        <span style="color: #ECBE7B;">&lt;2020-05-10 &#26085;&gt;</span>
        &#26102;&#38388;&#33539;&#22260;
        <span style="color: #ECBE7B;">&lt;2021-05-01 &#20845;&gt;--&lt;2020-06-01 &#19968;&gt;</span>
</pre>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-09-01 二]</span></span>
</p></li>
<li id="<span class="underline">C-c !</span>">类似与_C-c ._，不同的是它创建的是非活动的时间戳</li>
<li id="<span class="underline">S-LEFT/RIGHT</span> <code>(org-timestamp-down/up-day)</code>">将当前光标下的时间戳提前或延迟一天</li>
<li id="<span class="underline">S-UP/DOWN</span> <code>(org-timestamp-down/up)</code>">同上，不过支持对年，月，日，周，以及时间戳类型(非活动时间戳)进行变换。</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7577c6" class="outline-4">
<h4 id="orgf7577c6"><span class="section-number-4">1.8.3.</span> 截止日期和计划安排</h4>
<div class="outline-text-4" id="text-1-8-3">
<ul class="org-ul">
<li>State &ldquo;[待办]&rdquo;     from              <span class="timestamp-wrapper"><span class="timestamp">[2020-05-12 二 13:19]</span></span></li>
</ul>
<p>
在日常的日程安排中，需要在某些事项错过截止日期后进行警告提示，这时候可以为待办事项的时间戳添加一个关键字，从而让那个时间戳变为这个待办事项的截止日期:
</p>

<ul class="org-ul">
<li><p>
<span class="underline">C-c C-d</span> 插入截止时间戳
</p>
<div class="org-src-container">
<pre class="src src-org">        <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#23436;&#25104;ORG-MODE&#31508;&#35760;
          <span style="color: #83898d;">DEADLINE:</span> <span style="color: #ECBE7B;">&lt;2020-05-11 &#19968;&gt;</span>
        ** DONE &#31532;&#19968;&#37096;&#20998;
        ** TODO &#31532;&#20108;&#37096;&#20998;
</pre>
</div>
<p>
如果时间超过截止日期，那么将会报一个警告，直到这个待办事项为&ldquo;Done&rdquo;状态才会停止警告。
</p></li>
<li><p>
<span class="underline">C-c C-s</span> 插入开始时间戳
如果有了截止日期你还需要开始日期，通过下面的按键可以插入待办事项(非必须)的开始日期:
</p>
<div class="org-src-container">
<pre class="src src-org">        <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#23436;&#25104;ORG-MODE&#31508;&#35760;
          <span style="color: #83898d;">SCHEDULED:</span> <span style="color: #ECBE7B;">&lt;2021-05-10 &#19968;&gt;</span>
          <span style="color: #83898d;">DEADLINE:</span> <span style="color: #ECBE7B;">&lt;2020-05-11 &#19968;&gt;</span>
        ** DONE &#31532;&#19968;&#37096;&#20998;
        ** TODO &#31532;&#20108;&#37096;&#20998;
</pre>
</div>
<p>
如果当前的时间超过了计划的开始时间，那么推迟一天开始时间也会自动推迟。
</p>

<p>
有些需要重复执行的任务，可以为其添加一个间隔周期，例如下面这个例子就是每各一个月开始一次:
</p>
<div class="org-src-container">
<pre class="src src-org">        <span style="color: #bbc2cf; background-color: #282c34;">*</span> TODO &#23436;&#25104;ORG-MODE&#31508;&#35760;
          <span style="color: #83898d;">SCHEDULED:</span> <span style="color: #ECBE7B;">&lt;2021-05-10 &#19968; +1m&gt;</span>
          <span style="color: #83898d;">DEADLINE:</span> <span style="color: #ECBE7B;">&lt;2020-05-11 &#19968;&gt;</span>
        ** DONE &#31532;&#19968;&#37096;&#20998;
        ** TODO &#31532;&#20108;&#37096;&#20998;
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgb3eff32" class="outline-4">
<h4 id="orgb3eff32"><span class="section-number-4">1.8.4.</span> 记录工作时间</h4>
<div class="outline-text-4" id="text-1-8-4">
<p>
org-mode可以记录你在完成某项待办事项所用时间，下面是一些按键介绍：
</p>

<dl class="org-dl">
<dt><span class="underline">C-c C-x C-i</span> <code>(org-clock-in)</code></dt><dd><p>
开始为当前待办事项计时
开始计时后会在当前条目下创建一个带有 <b>CLOCK</b> 关键字的时间戳,如果指定了前缀参数，那么就会从最近的计时任务中选择。
</p>
<div class="org-src-container">
<pre class="src src-org">        <span style="color: #bbc2cf; background-color: #282c34;">*</span> &#20889;&#20195;&#30721;
          <span style="color: #5B6268;">:LOGBOOK:</span>
          <span style="color: #83898d;">CLOCK:</span> <span style="color: #ECBE7B;">[2020-05-11 &#19968; 16:09]--[2020-05-12 &#20108; 06:36]</span> =&gt; 14:27
          <span style="color: #5B6268;">:END:</span>
</pre>
</div></dd>
<dt><span class="underline">C-c C-x C-o</span> <code>(org-clock-out)</code></dt><dd><p>
停止计时
停止计时，它将会在刚刚开始计时处后创建一个时间戳，并且还会计算出开始时间和停止时间的时间差。
</p>
<div class="org-src-container">
<pre class="src src-org">        <span style="color: #bbc2cf; background-color: #282c34;">*</span> DONE &#20889;&#20195;&#30721;
          <span style="color: #5B6268;">:LOGBOOK:</span>
          <span style="color: #83898d;">CLOCK:</span> <span style="color: #ECBE7B;">[2020-05-11 &#19968; 16:10]--[2020-05-11 &#19968; 19:10]</span> =&gt;  3:00
          <span style="color: #5B6268;">:END:</span>
</pre>
</div>
<p>
<b>切换待办状态为&ldquo;DONE&rdquo;也会停止计时</b>
</p></dd>

<dt><span class="underline">C-c C-x C-e</span> <code>(org-clock-modify-effort-estimate)</code></dt><dd>更新计时任务进度</dd>
<dt><span class="underline">C-c C-x C-q</span> <code>(org-clock-cancel)</code></dt><dd>停止计时在你误操作计时时有用</dd>
<dt><span class="underline">C-c C-x C-j</span> <code>(org-clock-go)</code></dt><dd>跳转到计时任务
可以指定跳转到当前正在计时的条目去，如果指定前缀参数，那么会跳转到最近一次计时任务的条目下。</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgf9467a0" class="outline-3">
<h3 id="orgf9467a0"><span class="section-number-3">1.9.</span> 捕获-转发-归档</h3>
<div class="outline-text-3" id="text-1-9">
<p>
组织系统必有一个很重要的功能，那就是快速的捕获新想法和新任务，并将其与某些资料关联的能力。Org-mode中使用 <b>Capture</b> 实现。它能够将与一个任务相关的文件存储在一个特殊的目录下。可能在某个系统下，任务和项目经常需要移动位置，而将整个项目树保存到一个归档文件中有利于保持系统的简洁和快速。
</p>
</div>
<div id="outline-container-orgfd4d11c" class="outline-4">
<h4 id="orgfd4d11c"><span class="section-number-4">1.9.1.</span> 捕获</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
<b>本章借鉴了</b> <a href="https://www.zmonster.me/2018/02/28/org-mode-capture.html">此博客</a>。
org-mode能让你在工作时中断一会儿，来写一段简短的笔记。你可以为捕获新想法定义模板，并且将其笔记与不同的目标文件关联起来。
</p>
</div>
<div id="outline-container-orgf96a8c8" class="outline-5">
<h5 id="orgf96a8c8">设置捕获</h5>
<div class="outline-text-5" id="text-orgf96a8c8">
<p>
以下代码可以设置了保存笔记的默认文件地址，以及定义了一个捕获新想法的全局快捷键:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">       <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-default-notes-file</span>  <span style="color: #98be65;">"~/Documents/org/notes.org"</span><span style="color: #51afef;">)</span>

       <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">&#36825;&#37324;&#21069;&#38754;&#26377;&#20889;</span>
       <span style="color: #51afef;">(</span><span style="color: #c678dd;">global-set-key</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">kbd</span> <span style="color: #98be65;">"C-c c"</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-capture</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4ede7aa" class="outline-4">
<h4 id="org4ede7aa"><span class="section-number-4">1.9.2.</span> 使用Capture</h4>
<div class="outline-text-4" id="text-1-9-2">
<dl class="org-dl">
<dt><span class="underline">M-x org-capture</span></dt><dd>开始捕获
新建了一个缓冲区，用于编辑新捕获的想法。</dd>
<dt><span class="underline">C-c C-c</span></dt><dd>保存并返回原窗口
在编辑完新想法后，可以快速保存，并且返回原先的窗口，不会打断你的工作流。</dd>
<dt>C-c C-w</dt><dd>重新将当前项移动到其他位置
将一个或多个条目放置与其他地方。</dd>
<dt>C-c C-k</dt><dd>退出捕获过程并且复原到原本的状态。</dd>
</dl>
</div>
</div>
