.archived/templates/template.org
*** Capture模板
    可以使用模板来为不同情况下的要捕获项以不同方式来捕获到不同的位置。

    现在假设你想要使用一个模板来创建些普通的TODO条目，并且你想要将这些条目放置到 ~~/org/gtd.org~ 中的 *Task* 标题下，那么这个模板可以这么写:

    #+begin_src emacs-lisp
      (setq org-capture-templates
            '(("t" "Todo" entry (file+headline "~/org/gtd.org" "Task")
               "* TODO %?\n %i\n %a"))
    #+end_src

    如果你你还想用一种时间树的形式来记录捕获到的内容，那么可以这么写:

    #+begin_src emacs-lisp
      (setq org-capture-templates
            '(("j" "Journal" entry (file+datetree "~/org/journal.org")
               "* %?\n %U\n  %i\n  %a")))
    #+end_src
    让我们来分析一下这两个模板例子， ~org-capture-templates~ 这个变量保存着所有模板，它要求值是一个包含了多个模板的列表，所以我们每个模板都要写成一个列表，列表的第一个参数表示在Capture菜单中模板对应的快捷键，第二个参数表示在Capture菜单中模板快捷键对应的显示文本，第三个参数表示模板内容的类型，第四个参数表示模板内容的位置，第五参数是模板具体的写法。
    | 模板参数    | 例子内容                      | 描述           |
    |-------------+-------------------------------+----------------|
    | key         | "t"                           | 模板快捷键     |
    | description | "Todo"                        | 模板描述       |
    | type        | entry                         | 模板内容类型   |
    | target      | (file+headline "path" "Task") | 模板保存的位置 |
    | template    | "* TODO %?\n %i\n %a"         | 具体的模板     |
