.archived/templates/template.html
<div id="outline-container-org2ac6dd5" class="outline-4">
<h4 id="org2ac6dd5"><span class="section-number-4">1.9.3.</span> Capture模板</h4>
<div class="outline-text-4" id="text-1-9-3">
<p>
可以使用模板来为不同情况下的要捕获项以不同方式来捕获到不同的位置。
</p>

<p>
现在假设你想要使用一个模板来创建些普通的TODO条目，并且你想要将这些条目放置到 <code>~/org/gtd.org</code> 中的 <b>Task</b> 标题下，那么这个模板可以这么写:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">      <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-capture-templates</span>
            <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"t"</span> <span style="color: #98be65;">"Todo"</span> entry <span style="color: #a9a1e1;">(</span>file+headline <span style="color: #98be65;">"~/org/gtd.org"</span> <span style="color: #98be65;">"Task"</span><span style="color: #a9a1e1;">)</span>
               <span style="color: #98be65;">"* </span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;"> %?\n %i\n %a"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
</pre>
</div>

<p>
如果你你还想用一种时间树的形式来记录捕获到的内容，那么可以这么写:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">      <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-capture-templates</span>
            <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"j"</span> <span style="color: #98be65;">"Journal"</span> entry <span style="color: #a9a1e1;">(</span>file+datetree <span style="color: #98be65;">"~/org/journal.org"</span><span style="color: #a9a1e1;">)</span>
               <span style="color: #98be65;">"* %?\n %U\n  %i\n  %a"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
让我们来分析一下这两个模板例子， <code>org-capture-templates</code> 这个变量保存着所有模板，它要求值是一个包含了多个模板的列表，所以我们每个模板都要写成一个列表，列表的第一个参数表示在Capture菜单中模板对应的快捷键，第二个参数表示在Capture菜单中模板快捷键对应的显示文本，第三个参数表示模板内容的类型，第四个参数表示模板内容的位置，第五参数是模板具体的写法。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">模板参数</th>
<th scope="col" class="org-left">例子内容</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">key</td>
<td class="org-left">&ldquo;t&rdquo;</td>
<td class="org-left">模板快捷键</td>
</tr>

<tr>
<td class="org-left">description</td>
<td class="org-left">&ldquo;Todo&rdquo;</td>
<td class="org-left">模板描述</td>
</tr>

<tr>
<td class="org-left">type</td>
<td class="org-left">entry</td>
<td class="org-left">模板内容类型</td>
</tr>

<tr>
<td class="org-left">target</td>
<td class="org-left">(file+headline &ldquo;path&rdquo; &ldquo;Task&rdquo;)</td>
<td class="org-left">模板保存的位置</td>
</tr>

<tr>
<td class="org-left">template</td>
<td class="org-left">&ldquo;* TODO %?\n %i\n %a&rdquo;</td>
<td class="org-left">具体的模板</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: oeyoews</p>
<p class="date">Created: 2022-01-27 四 00:56</p>
</div>
</body>
</html>
